{
  "no": 129,
  "title": "Lights, Camera, Healing: Medicine On Screen",
  "mp3": "https://mcdn.podbean.com/mf/web/n86z5qgn6mx3g4wf/Narrative_Medicine_v3_1_2_9l4oq.mp3",
  "date": "2025 Apr 18",
  "season": 9,
  "template": "episode",
  "img_tile": "medical_theatre.jpg",
  "guests": [
    { "name": "Autumn Rennie",
      "title": "MD/PhD Candidate, University of Toronto",
      "img": "autumn_rennie.jpg"
    },
    { "name": "Hartley Jafine",
      "title": "Medical Improv Professor & Facilitator, McMaster University",
      "img": "hartley_jafine.jpg"
    },
    {"name": "Afreen Ahmad",
     "title": "MD Student, University of Toronto",
     "img": "afreen_ahmad.jpg"
    },
    {"name": "Rhea Varghese",
    "title": "MD Student, University of Toronto",
    "img": "rhea_varghese.jpg"
   }
  ],
  "notes": "In the words of Robert Mckee, our appetite for story is a reflection of the profound human need to grasp the patterns of living, not merely as an intellectual exercise, but within a very personal, emotional experience. Storytelling and narrative play a huge role in medicine. Many physicians are also artists, writers, actors, and musicians, and use their talents to advance healthcare. So how do theatre, film, and literature become powerful tools for advocacy, education, and healing? In this episode, we dive into the intersection of medicine and the arts through the lens of narrative medicine. We sit down with Autumn Rennie, an MD/PhD candidate at the University of Toronto, who shares how she uses film to amplify patient voices and advocate for change in healthcare. We also connect with Professor Hartley Jafine, a medical improv facilitator and lecturer, who shows us how applied theater can transform clinical practice. Through improv exercises, we learn how to strengthen communication, build empathy, and navigate power dynamics. Finally, we hear from our fellow medical students, Afreen and Rhea, as they share their creative passions in acting, writing, and their roles in U of T's DAFI musical.",
  "authors": [""],
  "prod_team": {
    "cc": [""],
    "sh": [""],
    "ep": [""],
    "ae": [""],
    "pv": [""],
    "sm": [""]
  },
  "tags": [],
  "links": [
    
  ]
}
